const age = +prompt("Який Ваш рік нарождення?");
const town = prompt("В якому місті Ви живете?");
const sport = prompt("Який Ваш улюбленний вид спорту?");

switch (true) {
  case age === 0 && town === null && sport === null:
  case age === 0 && town.trim() === "" && sport.trim() === "":
    alert(
      "Шкода, що Ви не захотіли ввести свій вік, місто та улюбленний спорт"
    );
    break;

  case isNaN(+age):
  case age === 0 || town || sport:
  case typeof age !== "number":
    alert("Шкода, що Ви не захотіли ввести свій вік");
    break;

  case town == null && age && sport:
  case town.trim() === "":
  case typeof +town === "number" && !isNaN(town):
    alert("Шкода, що Ви не захотіли ввести свoє місто");
    break;

  case sport == null && age && town:
  case sport.trim() === "":
  case typeof +sport === "number" && !isNaN(sport):
    alert("Шкода, що Ви не захотіли ввести свій улюбленний спорт");
    break;

  case town === "Київ" && sport === "Бокс":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці України." +
        " " +
        "Круто! Хочеш стати як Майк Тайсон?"
    );
    break;
  case town === "Вашингтон" && sport === "Бокс":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці США." +
        " " +
        "Круто! Хочеш стати як Майк Тайсон?"
    );
    break;
  case town === "Лондон" && sport === "Бокс":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці Великобританії." +
        " " +
        "Круто! Хочеш стати як Майк Тайсон?"
    );
    break;

  case town === "Київ" && sport === "ММА":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці України." +
        " " +
        "Круто! Хочеш стати як Конор Магрегор?"
    );
    break;
  case town === "Вашингтон" && sport === "ММА":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці США." +
        " " +
        "Круто! Хочеш стати як Конор Магрегор?"
    );
    break;
  case town === "Лондон" && sport === "ММА":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці Великобританії." +
        " " +
        "Круто! Хочеш стати як Конор Магрегор?"
    );
    break;

  case town === "Київ" && sport === "Футбол":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці України." +
        " " +
        "Круто! Хочеш стати як Ліонель Мессі?"
    );
    break;
  case town === "Вашингтон" && sport === "Футбол":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці США." +
        " " +
        "Круто! Хочеш стати як Ліонель Мессі?"
    );
    break;
  case town === "Лондон" && sport === "Футбол":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці Великобританії." +
        " " +
        "Круто! Хочеш стати як Ліонель Мессі?"
    );
    break;

  case sport === "Бокс":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у місті:" +
        " " +
        town +
        " " +
        "Круто! Хочеш стати як Майк Тайсон?"
    );
    break;
  case sport === "ММА":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у місті:" +
        " " +
        town +
        " " +
        "Круто! Хочеш стати як Конор Магрегор?"
    );
    break;
  case sport === "Футбол":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у місті:" +
        " " +
        town +
        " " +
        "Круто! Хочеш стати як Ліонель Мессі?"
    );
    break;

  case town === "Київ":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці України"
    );
    break;
  case town === "Вашингтон":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці США"
    );
    break;
  case town === "Лондон":
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у столиці Великобританії"
    );
    break;

  default:
    alert(
      "Ваш вік:" +
        " " +
        (2022 - age) +
        "років" +
        " " +
        "Ви живете у місті:" +
        " " +
        town
    );
}
